<?php

namespace app\api\controller;

use app\admin\model\Company;
use app\admin\model\QcObj as ObjModel;
use app\common\controller\Api;
use app\common\model\Queue;
use GuzzleHttp\Client;
use GuzzleHttp\Pool;
use GuzzleHttp\Psr7\Request;
use jlqc\FundManagement;
use think\Cache;
use think\Db;
use think\Exception;


/**
 * 广告投放数据相关定时任务类
 */
class QcAdv extends Api
{
    protected $noNeedLogin = '*';
    protected $noNeedRight = '*';

    public function index()
    {
        $token = Cache::get("qc_access_token");
        $page = Cache::get('adv_status_page', 1);
//        dump(Cache::rm('adv_status_page'));
//        die;
        dump(count([
            1758884827150343,1806530434606160,
            1805444940093513,1805538212694170,1805444590695514,
            1804908844231771,1804797098917130,1758973351213063,1804796249520297,1804908811274307,
            1804796938316876,1804797055470683,
            1804797015140352,
            1801012212665641,1801012247182580,1801640330326313,
            1801012394075211,1801012307647577,1801012356788361,
            1799715351690409,1799202331100362,
            1799202254813291,1799202075804747,1799202295073801,
            1798472044605593,
            1796756537147467,
            1795937699753995,
            1794119092369419,
            1782887574421516,1776192320549895,1736134227120135,1787783827048458,1776192622869511,1763477258532942,1771637257913357,1728507927267399,1782442101920795,1785147229945860,1775167612945420,1776192452456580,1767841706079239
            ,1791228387868682,
            1785780658184265,
            1784696787974220,1784337779831819,1784337738523723,
            1783787231027212,1783787151608841,1783787107553289,1783787192083658,1783786851816586,1783787062732891,
            1780807543182347,1781793307628618,
            1781095203992580,
            1776253156174856,
            1776530220369928,1776004704358413,
            1775711225499783,
            1771463534832654,1771302914848776,1771465628703751,
            1768748487108621,1771463721125896,1769279463678093,1769103516511240,
            1767767739665416,1768751271614535,1770732045736029,1768466482225230,1765754058500295,
            1760242971042824,1761140252272648,
            1762132966736903,1751369221467149,1760214990224391,1752340384845837,
            1747106583236622,1751080353253383,
            1746912000942093,1746645992770574,
            1746558720101389,1746639817774158,
            1746561628849159,
            1745302711733261,
            1744721662416904,1744721539936269,
            1743299912937607,1743300539283464,
            1742110891921421,
            1742003458043912,
            1741297704064013,1741397077518350
        ]));
        die;
        echo $page;
//        if ($page == 20) {
//            echo $page;
//            die
//        }
//        $page = 23;
        $companyModel = new Company();
        $all = $companyModel->where(['advertiser_id'=>['not in',[
            1758884827150343,1806530434606160,
            1805444940093513,1805538212694170,1805444590695514,
            1804908844231771,1804797098917130,1758973351213063,1804796249520297,1804908811274307,
            1804796938316876,1804797055470683,
            1804797015140352,
            1801012212665641,1801012247182580,1801640330326313,
            1801012394075211,1801012307647577,1801012356788361,
            1799715351690409,1799202331100362,
            1799202254813291,1799202075804747,1799202295073801,
            1798472044605593,
            1796756537147467,
            1795937699753995,
            1794119092369419,
            1782887574421516,1776192320549895,1736134227120135,1787783827048458,1776192622869511,1763477258532942,1771637257913357,1728507927267399,1782442101920795,1785147229945860,1775167612945420,1776192452456580,1767841706079239
            ,1791228387868682,
            1785780658184265,
            1784696787974220,1784337779831819,1784337738523723,
            1783787231027212,1783787151608841,1783787107553289,1783787192083658,1783786851816586,1783787062732891,
            1780807543182347,1781793307628618,
            1781095203992580,
            1776253156174856,
            1776530220369928,1776004704358413,
            1775711225499783,
            1771463534832654,1771302914848776,1771465628703751,
            1768748487108621,1771463721125896,1769279463678093,1769103516511240,
            1767767739665416,1768751271614535,1770732045736029,1768466482225230,1765754058500295,
            1760242971042824,1761140252272648,
            1762132966736903,1751369221467149,1760214990224391,1752340384845837,
            1747106583236622,1751080353253383,
            1746912000942093,1746645992770574,
            1746558720101389,1746639817774158,
            1746561628849159,
            1745302711733261,
            1744721662416904,1744721539936269,
            1743299912937607,1743300539283464,
            1742110891921421,
            1742003458043912,
            1741297704064013,1741397077518350
        ]]])->order('id desc')->page($page)->limit(100)->column('advertiser_id');
//        dump($all);
//        die;
        if(empty($all)){
            echo "全部处理完了";

            die;
        }
        $res = FundManagement::get_adv_info($token, urlencode(json_encode($all)));
        if ($res['code'] == 40002) {
            echo $res['message'] . '</br>';
            die;
//            $requests = $this->buildGuzzleRequest($all);
//            $this->sendGuzzleRequest($requests);
        } else {
            echo '没问题';
        }
        $page++;
        Cache::set('adv_status_page', $page);
//        $this->index();
    }


    protected function buildGuzzleRequest($advIds): array
    {
        $access_token = Cache::get("qc_access_token");
        $url = "https://ad.oceanengine.com/open_api/2/advertiser/info";
        $headers = [
            'Access-Token' => $access_token,
            'Content-Type' => 'application/json'
        ];
        $requests = [];

        foreach ($advIds as $advId) {
            $params = [
                "advertiser_ids" => urlencode(json_encode([(int)$advId])),
            ];
            $request = new Request('GET', $url, $headers, $params);
            $requests[] = ['request' => $request, 'params' => $params];
        }
        return $requests;
    }

    protected function sendGuzzleRequest($requests)
    {
        $insertData = [];
        $guzzleClient = new Client();
        // 并发请求
        $pool = new Pool($guzzleClient, array_column($requests, 'request'), [
            'concurrency' => 50,  // 控制并发数
            'fulfilled' => function ($response, $index) use (&$insertData, $requests) {
                $resData = json_decode($response->getBody()->getContents(), true);
                $requestInfo = $requests[$index]['params'];
                $requestAdvId = $requestInfo['advertiser_ids'];
//                dump($resData);
                if (!empty($resData) && $resData['code'] != 0 ) {
                    echo $resData['code'];
                    echo $resData['message'].$requestAdvId[0];
                }
            },
            'rejected' => function ($reason, $index) {
                echo "Request {$index} failed: " . $reason->getMessage() . "\n";
            },
        ]);

        // 等待所有请求完成
        $promise = $pool->promise();
        $promise->wait();

        return $insertData;
    }

}
